==================
int variable declaration
==================

int number = 32

---

(source_file
  (variable_declaration
    (type)
    (identifier)
    (expression
      (number_literal))))


==================
float variable declaration
==================

float pi = 3.1

---

(source_file
  (variable_declaration
    (type)
    (identifier)
    (expression
      (float_literal))))


==================
string variable declaration
==================

str message = "mmmnm i love frogs"

---

(source_file
  (variable_declaration
    (type)
    (identifier)
    (expression
      (string_literal))))


==================
operator precedence
==================

int num = 4 + 3 * 8

---

(source_file
  (variable_declaration
    (type)
    (identifier)
    (expression
      (binary_expression
        (expression
          (number_literal))
        (expression
          (binary_expression
            (expression
              (number_literal))
            (expression
              (number_literal))))))))
           

==================
normal vector
==================

vec(int) numbers = [2, 3, 4, 5, 4]

---

(source_file
  (variable_declaration
    (type
      (vec_type
        (type)))
    (identifier)
    (expression
      (vec_literal
        (expression (number_literal))
        (expression (number_literal))
        (expression (number_literal))
        (expression (number_literal))
        (expression (number_literal))))))


==================
slightly sillier vec
==================

vec(int) numbers = [2 3 4 5]

---

(source_file
  (variable_declaration
    (type
      (vec_type
        (type)))
    (identifier)
    (expression
      (vec_literal
        (expression (number_literal))
        (expression (number_literal))
        (expression (number_literal))
        (expression (number_literal))))))


==================
very silly vec
==================

vec(int) numbers = [2 3,, 4 5,,, 4,,]

---

(source_file
  (variable_declaration
    (type
      (vec_type
        (type)))
    (identifier)
    (expression
      (vec_literal
        (expression (number_literal))
        (expression (number_literal))
        (expression (number_literal))
        (expression (number_literal))
        (expression (number_literal))))))


==================
map declaration
==================

map(str, int) team_scores = { "yellow": 2, "red": 5 }

---

(source_file
  (variable_declaration
    (type
      (map_type
        (type)
        (type)))
    (identifier)
    (expression
      (map_literal
        (map_entry
          (expression (string_literal))
          (expression (number_literal)))
        (map_entry
          (expression (string_literal))
          (expression (number_literal)))))))

==================
set declaration
==================

set(int) passing_teams = { 2, 4, 5 }

---

(source_file
  (variable_declaration
    (type
      (set_type
        (type)))
    (identifier)
    (expression
      (set_literal
        (expression (number_literal))
        (expression (number_literal))
        (expression (number_literal))))))


==================
empty set
==================

set(int) losers = {}

---

(source_file
  (variable_declaration
    (type
      (set_type
        (type)))
    (identifier)
    (expression
      (set_literal))))
